# OptionConflictBoundariesVaryMainSeparate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..OptionConflictBoundariesVaryMainSeparate Property
BuiltInFailures..::..RoomFailures Class See Also
---
Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OptionConflictBoundariesVaryMainSeparate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OptionConflictBoundariesVaryMainSeparate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OptionConflictBoundariesVaryMainSeparate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace